
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/8320449410)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_telegram_webhook_path_base&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_telegram_webhook_user_id&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_path_base"] will be created
  + resource "google_secret_manager_secret" "proxy-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_webhook_path_base"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_user_id"] will be created
  + resource "google_secret_manager_secret" "proxy-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_webhook_user_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":177,"Program":"tfcmt","SHA1":"2781d5300e2efebc0508723abfaa14b5f519707f","Vars":{},"WorkflowName":"iaac_plan"} -->